{
  "basics": {
    "name": "Daniel Plas Rivera",
    "label": "Python Full Stack Developer",
    "picture": "",
    "email": "plasx1987@gmail.com",
    "phone": "(212) 470-2431",
    "summary": "12+ years of experience in software engineering, passionate about modern and upcoming technologies. I love enabling older applications to work with present day technologies. I enjoy working with front end and back end stacks, even the multiple layers under them.",
    "location": {
      "address": "40 W 135th St",
      "postalCode": "NY 10037",
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "plasx",
        "url": "https://twitter.com/plasx"
      },
      {
      "network": "Linkedin",
      "username": "https://www.linkedin.com/in/plasnyc",
      "url": "https://www.linkedin.com/in/plasnyc"
      },
      {
      "network": "Github",
      "username": "plasx",
      "url": "https://github.com/plasx"
      }
    ]
  },
  "work": [
    {
      "company": "McKinsey & Company",
      "position": "Senior Software Engineer",
      "website": "https://www.mckinsey.com/",
      "startDate": "2020-05-29",
      "summary": "Working with the primary focus on data engineering initiatives at the Firm",
      "highlights": [
        "Worked with vendor APIs team on diagnosing causes for bottlenecks",
        "Aided Data Democracy Initiative on the Firm's unified datalake vision",
        "Worked with various teams on preparing their data for the datalake",
        "Taught various teams how to work with their data pipelines",
        "Build enterprise grade pipelines that are able to perform asynchronous ETL on 100s of gigbytes of data and send data to S3",
        "Craft intelligent systems which can alert engineer team if theres inconsistencies",
        "Architect roadmaps, diagrams, and plans for various stages of development.",
        "Build systems to grab Splunk logs for data analytics dashboard needs",
        "Work with risk to ensure data meets the Firms data classification policy",
        "Build snowpipes and snowstages for externally staged data in Azure Blob and AWS S3",
        "Built out asynchronous python applications to take maximum advantage of REST APIs to move data faster",
        "Built out Kafka data streams for product data",
        "Setup AWS API Gateways and created ETL pipelines with AWS Lambda to snowflake",
        "Stack: Python, Snaplogic, Azure SQL, Postgres, Docker, S3, Splunk, Snowflake, Snowpipe, Lambda, IAM, API Gateway"
      ]
    },
    {
      "company": "Price Waterhouse Coopers",
      "position": "Developer - Contractor",
      "website": "http://pwc.com",
      "startDate": "2019-12-04",
      "endDate": "2020-03-20",
      "summary": "Created PwC's Data Landscape, an analyzer to determine the risk level of data provided by a client.",
      "highlights": [
        "Created the backend for the React SPA to consume.",
        "Learned and implemented proprietary PwC React components",
        "Developed stakeholder's vision to detect and assess security risks of uploaded data.",
        "Architect roadmaps, diagrams, and plans for various stages of development.",
        "Stack: Docker, Django3 , Python3, Graphene, Graphql, DRF, React"
      ]
    },
    {
      "company": "Capital One",
      "position": "Master Software Engineer - Contractor",
      "website": "https://www.capitalone.com",
      "startDate": "2019-05-13",
      "endDate": "2019-08-22",
      "summary": "Architected/rebuilt Credit Risk Rating Platform enabling internal systems to perform risk rating of customers and facilities aiding bank decision making in credit approval process, as well as ongoing portfolio management.",
      "highlights": [
        "Create dockerized microservices with clear documentation.",
        "Provided code reviews and broke epics into stories for the team",
        "highly detailed documentation per micro service and python package.",
        "Built microservice for utlizing data models for finding Probability of default of a client",
        "Worked with team to create a new platform featuring aspects of its predecessor.",
        "Stack: Python, flask, sqlalchemy, oracle, postgres, jenkins, docker, docker-compose, artifactory"]
    },
    {
      "company": "Cox Automotive",
      "position": "Sr. Python Full Stack Engineer - Contractor",
      "website": "https://www.coxautoinc.com",
      "startDate": "2018-08-08",
      "endDate": "2019-03-01",
      "summary": "Full Stack Python Engineer in Finance & Insurance, focused on Docker Container infrastructure, Pipelines in CI/CD and SOA Appliances. Analyzed and improved pre-existing architecture increasing performance of services and platform.",
      "highlights": [
        "Made Jenkins groovy scripts to build, upload, and deployment of new docker images to Artifactory on Git PR merges.",
        "Utilized New Relic and Splunk for identifying under performing flows, issues and bottlenecks.",
        "Optimized code to improve performance and scalability.",
        "Documented new and undocumented services.",
        "Stack: Python, django, flask, celery, react, redis, oracle, postgres, mongodb, jenkins, docker, docker-compose, IBM datapower, artifactory, splunk, new relic"
      ]
    },
    {
      "company": "Price Waterhouse Coopers",
      "position": "Developer - Contractor",
      "website": "http://pwc.com",
      "startDate": "2017-12-04",
      "endDate": "2018-07-02",
      "summary": "Implemented VPN technologies into PwC internal tax audit platform on Azure. Used Docker/Docker-Compose to launch VPN containers when initiated by PaaS.",
      "highlights": [
        "Debugged React and Django integrations.",
        "Worked on VPN features for our internal tax audit platform, developed frontend, and backend solutions utilizing Django.",
        "Refactored Python applications for SnapLogic data pipelines.",
        "Built vSEC lab environments to mimic possible virtualized security solution configurations.",
        "Stack: Python3, celery, celery beat, redis, sqlite, react, django, docker, docker-compose, VSTS, Azure, ip-sec, vpn, openconnect, Snaplogic, AWS, Checkpoint Vsec, pulse secure"
      ]
    },
    {
      "company": "Bank of America",
      "position": "Application Architect V - Contractor",
      "website": "http://bankofamerica.com",
      "startDate": "2017-07-10",
      "endDate": "2017-10-17",
      "summary": "Collaborated cross functionally to develop target state cloud architecture and supporting organization model along with the platform roadmap required to achieve that target state.",
      "highlights": [
        "Build REST APIs to match specs provided by other teams to deliver needed functionality.",
        "Executes POCs and feasibility studies to validate next-gen product concepts and technologies leveraging results to guide business and technology decisions.",
        "Enforce adherence to architectural standards/principles, global product-specific guidelines, usability design standards",
        "Stack: Python3, Microsoft Azure, Terraform, Packer, Git, Flask, Flask-RestPlus, MongoDB, TDD, Agile, Kanban, Jenkins"
      ]
    },
    {
      "company": "Columbia University",
      "position": "Application Systems Developer - Python/PHP",
      "website": "http://columbia.edu",
      "startDate": "2016-04-18",
      "endDate": "2017-07-06",
      "summary": "Transitioned university to a Python stack while maintaining compatibility with legacy technologies.",
      "highlights": [
        "Built Full Stack Python Applications for the University.",
        "Wrote Python scripts to parse JSON documents and load the data in database.",
        "Development locally with Vagrant and Docker for virtualized instances of servers and databases on the fly.",
        "Built REST APIs to serve out data from databases to legacy systems.",
        "Programmatically established levels of authorized access to restrict-allow systems REST API access.",
        "Created and planned out the server flow infrastructure for python web app stack for Columbia University.",
        "Followed Agile SDLC, made sure code was always up to PEP8 standards, and servers (with code) passed unit & load tests.",
        "Stack: Python3, python2, GIT, Flask/Blueprint, JIRA, Apache 2.2, Mod_WSGI, Oracle(11g,12c), Axure RP, Vagrant, Docker, Jenkins, Virtualbox, Postman, LTI, Oauth1, Oauth2, REST, Sakai, Canvas, Unix Bash/Shell Script, CRON, JavaScript, Nodejs, JSON"
      ]
    },
    {
      "company": "Brainy Maps",
      "position": "President",
      "website": "https://gogobanana.net/",
      "startDate": "2016-06-01",
      "endDate": "2017-11-11",
      "summary": "Based on your location you will be exposed real time to information in real time, based on their location!",
      "highlights": [
        "Implement Google Maps for our platform and style it for plotting our data.",
        "Create menu using React.JS for restful api CRUD events for events management and notifications.",
        "Recreating app in React Native with focus on iOS."
      ]
    },
    {
      "company": "Thinkful",
      "position": "Python & Front-end Web Development Mentor",
      "website": "http://thinkful.com",
      "startDate": "2015-06-18",
      "endDate": "2016-04-06",
      "summary": "Mentored those pursuing careers in web development or Python.",
      "highlights": [
        "Mentor students in web development as they work through a project-based curriculum.",
        "Guide students through the challenges of becoming a developer.",
        "Lead weekly one-on-one online student questions/answers sessions to provide feedback on student code and projects."
      ]
    },
    {
      "company": "Work-Bench",
      "position": "Part Time Developer",
      "website": "http://www.work-bench.com",
      "startDate": "2015-11-12",
      "endDate": "2016-07-01",
      "summary": "Delivered a dynamic, interactive mobile friendly/mobile revamp of Work-Bench careers page.",
      "highlights": [
        "Built a job scraper using the Indeed API to pull all of the companies member/portfolio jobs.",
        "Developed page to let users sort the received api feed and browse by location, job function, category.",
        "Stack: Git, Heroku, Ruby, Middleman Framework, REST, JavaScript, Jslint, JSON, Twitter Bootstrap, SCSS, Media Queries."
      ]
    },
    {
      "company": "Basics Plus",
      "position": "Lead Full Stack Developer",
      "website": "http://basicsplus.com",
      "startDate": "2015-01-15",
      "endDate": "2015-06-01",
      "summary": "Constructed an unrivaled online experience that connects to the current POS system for the fast-growing chain of houseware & hardware stores in NYC.",
      "highlights": [
        "Developed an e-commerce solution to ensure the company developed as a national online retailer.",
        "On boarded and trained the team for Full stack Web Development and the SEO team.",
        "Worked with Google Online Strategist to revamp ad campaigns, increase sales, and raise our site ranking.",
        "Worked with Google Tag Implementation Team to complete the installation of Dynamic Re-marketing Code and E-Commerce Tracking in Magento for adwords.",
        "Created and managed, and implemented new features for subsidiaries’ e-commerce companies JuicifyMe, LibrettoEspresso, MyEspressoStore.",
        "Stack: Magento, MySQL, SEO, Google Analytics, Google AdWords, PHP, JavaScript, Jquery, GIT, CSS3, HTML5, Photoshop, Photography, Twitter Bootstrap"
      ]
    },    
    {
      "company": "New York City College Of Technology",
      "position": "College Laboratory Technician",
      "website": "http://citytech.cuny.edu",
      "startDate": "2014-01-01",
      "endDate": "2015-01-01",
      "summary": "Assisted professors to instruct courses.",
      "highlights": [
        "Evaluate course plans",
        "Teach and troubleshoot code, video projects, technology hacks, Arduino projects, and apps using Emotiv created by students",
        "Gave demos on emerging technologies",
        "Ensured equipment readiness for classes",
        "Performed woodwork, arc welding, wood shop maintenance",
        "Stack: Adobe Photoshop, Adobe Premiere Pro, Pro Logic, Arduino, Raspberry Pi, MakerBot Printers"
      ]
    },
    {
      "company": "The K.I.S. Foundation, Inc.",
      "position": "Part Time Full Stack PHP Developer",
      "website": "http://thekisfoundation.org",
      "startDate": "2010-06-01",
      "endDate": "2017-09-18",
      "summary": "Helped high profile client raise awareness for sickle cell disease by providing an online experience.",
      "highlights": [
        "Migrated existing site from Joomla to Wordpress",
        "Developed a customized redesigned Wordpress theme for posting latest updates and charity events",
        "Updated the sites code, design and feel annually",
        "Stack: Wordpress, Joomla, MySQL, PHP, HTML, CSS, JavaScript, Adobe Photoshop"
      ]
    },
    {
      "company": "The Next Phase Entertainment, LLC.",
      "position": "Part Time Full Stack PHP Developer",
      "website": "http://weaproblem.com",
      "startDate": "2009-06-01",
      "endDate": "2013-12-30",
      "summary": "Conceptualized, styled and developed unique websites for multiple artists under the Next Phase Entertainment label.",
      "highlights": [
        "Stack: WordPress, PhpMyAdmin, MySQL, PHP, HTML5, CSS3, Jquery, Twitter Bootstrap, Adobe Photoshop"
      ]
    }
  ],
  "education": [
  {
    "institution": "Hunter College",
    "area": "Emerging Media",
    "startDate": "2014-02-27",
    "endDate": "2014-05-24"
  },
  {
    "institution": "New York City College of Technology",
    "area": "Emerging Media Technologies",
    "startDate": "2011-11-26",
    "endDate": "2013-05-24"
  },
  {
    "institution": "Borough of Manhattan Community College",
    "area": "Multimedia Programming & Design",
    "startDate": "2005-01-16",
    "endDate": "2010-12-15"
  },
  {
    "institution": "School of Cooperative Technical Education",
    "area": "Cisco Networking And CompTIA PC Repair Training",
    "startDate": "2003-12-23",
    "endDate": "2005-01-05"
  }
  ],
  "awards": [
    {
      "title": "Hack NYU Hackathon",
      "date": "2014-05-06",
      "awarder": "NYU",
      "summary": "MVP Winner. SudoLove connects participants, sponsors and mentors for global hackathons via an app."
    },
    {
      "title": "AngelHack 2016 Manhattan",
      "date": "2016-06-04",
      "awarder": "AngelHack",
      "summary": "Winning Grand Prize(Hackcelerator) and Best Use Of Amazon Web Services. New York Minute is your pocket companion app to eliminate the frustration of getting around in New York City. It calculates the fastest, cheapest way to get to the desired destination by comparing the Uber car service and public transportation. Target users are New Yorkers who understand the fast pace of New York City life. Sponsors Technologies used Amazon AWS: Elastic Beanstalk, EBS, EC2, Route 53, S3 Amazon Alexa Esri ArcGIS."
    }
  ],
  "references": [
    {
    "name": "Latonia Robinson, Dir. of Operations, The K.I.S. Foundation",
    "reference": "Daniel is an absolute joy to work with and continues to impress us with his technical skill sets. Whenever we have a problem with our website, he always has the answer or recommendations for improvement. Daniel follows direction well, he's always aware of the latest programs or trends, he works well with deadlines, he's able to communicate effectively, he's super reliable, and his experience is absolutely priceless. We're so thankful to have him working with us as part of our team! "
    },
    {
    "name": "Antonio Riccardi, Web Engineer at Basics Plus",
    "reference": "Daniel is one of the best developers we know. His speed and ability to conquer any challenge thrown at him helped us recover our online presence. He led our team here through rigorous challenges with unique solutions each time always getting the job done before the deadlines. Working with him was a blast and we would recommend him when it comes to handling tough projects!"
    }
  ]
}
