{
  "basics": {
    "name": "Daniel Plas Rivera",
    "label": "Python Full Stack Developer",
    "picture": "",
    "email": "plasx1987@gmail.com",
    "phone": "(212) 470-2431",
    "summary": "9 years of experience as a Full Stack Web/Application Developer passionate about modern & upcoming technologies. I find myself addicted to testing out new technologies. I love front end and back end technologies, I even love the multiple layers under them! I dislike Perl, Ruby, aging tech stacks. I love hacking hardware making things do what they weren't intended for and discovering new uses! I imagine one day I'll be able to code an Nintendo game in assembly :)",
    "location": {
      "address": "6 E 126 St",
      "postalCode": "NY 10035",
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "plasx",
        "url": "https://twitter.com/plasx"
      },
      {
      "network": "Linkedin",
      "username": "https://www.linkedin.com/in/plasnyc",
      "url": "https://www.linkedin.com/in/plasnyc"
      },
      {
      "network": "Github",
      "username": "plasx",
      "url": "https://github.com/plasx"
      }
    ]
  },
  "work": [
    {
      "company": "Price Waterhouse Coopers",
      "position": "Developer - Contractor",
      "website": "http://pwc.com",
      "startDate": "2017-12-04",
      "summary": "Took ownership of implementation of VPN technologies into our PaaS (Platform As a Service). While in charge of setting up VPN Infrastructure on Azure, used Docker and Docker-compose to have VPN containers launched when initiated by the PaaS. I worked at PwC offices in San Jose, and in San Francisco for this role.",
      "highlights": [
        "Debugged React and Django integrations",
        "Worked on VPN features for our PaaS, developed frontend, and backend solutions utilizing Django",
        "Refactored Python applications for Snaplogic pipelines",
        "Built vSEC lab environments to mimic possible virtualized security solution configurations",
        "Stack: Python3, celery, celery beat, redis, sqlite, react, django, docker, docker-compose, VSTS, Azure, ip-sec, vpn, openconnect, Snaplogic, AWS, Checkpoint Vsec, pulse secure"
      ]
    },
    {
      "company": "Bank of America",
      "position": "Application Architect V - Contractor",
      "website": "http://bankofamerica.com",
      "startDate": "2017-07-10",
      "endDate": "2017-10-17",
      "summary": "Collaborate cross functionally to develop our target state cloud architecture and supporting organization model along with the platform roadmap required to achieve that target state. Define multiyear platform strategy adjusting to new technologies and requirements as they evolve. Drive cloud technology discussions and facilitate decision with other teams within the organization. Keep abreast of and gain expertise in the evolving technology and understand how new technologies could be applied to our Cloud offering.",
      "highlights": [
        "Stay current with IAAS & PAAS trends and incorporate emerging technology to benefit the platform",
        "Research, test and understand the value of a containerized cloud offerings",
        "Executes POCs and feasibility studies to validate next-gen product concepts and technologies leveraging results to guide business and technology decisions",
        "Enforce adherence to architectural standards/principles, global product-specific guidelines, usability design standards, etc",
        "Work with product owners and other functional teams to translate the roadmap into releases",
        "Drive technical designs to consensus and approval",
        "Stack: Python3, Microsoft Azure, Terraform, Packer, Git, Flask, Flask-RestPlus, MongoDB, TDD, Agile, Kanban, Jenkins"
      ]
    },
    {
      "company": "Columbia University",
      "position": "Application Systems Developer - Python/PHP",
      "website": "http://columbia.edu",
      "startDate": "2016-04-18",
      "endDate": "2017-07-06",
      "summary": "Work on transitioning Columbia University to a Python stack while maintaining compatibility with older technologies. This including: 1) creating and implementing a server flow working with older components to make sure nothing breaks,  2) Recreate improved versions of older applications with the Python stack, and 3) creating middleware for older apps to interact with new technologies.",
      "highlights": [
        "Built Full Stack Python Applications for the University",
        "Wrote Python scripts to parse JSON documents and load the data in database.",
        "Created automated ETL tool from the ground up to transfer from JSON, CSV, TSV, to database daily",
        "Developement locally with Vagrant and Docker for virtualized instances of servers and databases on the fly",
        "Created automated script to make REST api calls with server, parse output report to excel files daily",
        "Used GIT, JIRA, and ServiceNOW for version control and to handle project issues, workflow and tickets",
        "Created and planned out the server flow infrastructure for python web app stack for Columbia University",
        "Follows Agile SDLC, made sure code is always up to PEP8 standards, and servers (with code) pass unit & load tests",
        "Create big data apps using existing data from multiple databases at Columbia, prep for Hadoop, demo monthly data using Tableau",
        "Expose flaws, exploits, problems and solutions during scrums, quickly figure out if requirements provided are impossible or not",
        "Stack: Python3, python2, GIT, Flask/Blueprint, Service-Now, JIRA, Apache 2.2, Mod_WSGI, Oracle(11g,12c), Axure RP, Vagrant, Docker, Jenkins, Virtualbox, Postman, LTI, Oauth1, Oauth2, REST, Sakai, Canvas, ServiceNow, Unix Bash/Shell Script, CRON, Javascript, Nodejs, JSON, Tableau, ETL, Data Warehousing"
      ]
    },
    {
      "company": "Brainy Maps",
      "position": "President",
      "website": "https://gogobanana.net/",
      "startDate": "2016-06-01",
      "summary": "BrainyMaps was established after winning AngelHack 2016 Manhattan. My partner and I adjusted our winning concept and conceived Go Go Banana, which is a web app allows the user to see events as they occur from geo tagged tweets to Event Brite events. Based on your location you will be exposed REAL TIME to information in REAL TIME, based on their location!",
      "highlights": [
        "Implement Google Maps for our platform and style it for plotting our data",
        "Create menu using React.JS for restful api CRUD events for events management and notifications",
        "Recreating app in React Native with focus on iOS"
      ]
    },
    {
      "company": "Thinkful",
      "position": "Python & Front end Web Development Mentor",
      "website": "http://thinkful.com",
      "startDate": "2015-06-18",
      "endDate": "2016-04-06",
      "summary": "Educating learners or students who wish to pursue careers in web development or python",
      "highlights": [
        "Mentor students in web development as they work through a project-based curriculum.",
        "Guide students through the challenges of becoming a developer.",
        "Lead weekly one-on-one online student questions/answers sessions to provide feedback on student code and projects."
      ]
    },
    {
      "company": "Work-Bench",
      "position": "Part Time Developer",
      "website": "http://www.work-bench.com",
      "startDate": "2015-11-12",
      "endDate": "2016-07-01",
      "summary": "Tasked to deliver a dynamic interactive mobile friendly/mobile first revamp of the careers page for individuals to find open positions at all the companies that started at Work-bench.",
      "highlights": [
        "Built a job scraper using the Indeed API to pull all of the companies member/portfolio jobs",
        "Developed page to let users sort the received api feed and browse by location, job function, category",
        "Stack: Git, Heroku, Ruby, Middleman Framework, REST, Javascript, Jslint, JSON, Twitter Bootstrap, SCSS, Media Queries"
      ]
    },
    {
      "company": "Basics Plus",
      "position": "Lead Full Stack Developer",
      "website": "http://basicsplus.com",
      "startDate": "2015-01-15",
      "endDate": "2015-06-01",
      "summary": "Tasked to deliver an unrivaled online experience that connects to the current POS system for the fast growing chain of houseware & hardware stores in NYC",
      "highlights": [
        "Developed an e-commerce solution to ensure the company developed as a national online retailer",
        "Onboarded and trained the team for Fullstack Web Development and the SEO team",
        "Worked with Google Online Strategist to revamp ad campaigns, increase sales, and raise our site ranking",
        "Worked with Google Tag Implementation Team to complete the installation of Dynamic Remarketing Code and E-Commerce Tracking in Magento for adwords",
        "Created and managed, and implemented new features for subsidiarie's e-commerce companies JuicifyMe, LibrettoEspresso, MyEspressoStore",
        "Stack: Magento, MySQL, SEO, Google Analytics, Google Adwords , PHP, Javascript, Jquery, GIT, CSS3, HTML5, Photoshop, Photography, Twitter Bootstrap"
      ]
    },
    {
      "company": "New York City College Of Technology",
      "position": "College Laboratory Technician",
      "website": "http://citytech.cuny.edu",
      "startDate": "2014-01-01",
      "endDate": "2015-01-01",
      "summary": "Assisted professors instruct courses",
      "highlights": [
        "Evaluate course plans",
        "Teach and troubleshoot code, video projects, technology hacks, Arduino projects, and apps using Emotiv created by students",
        "Gave demos on emerging technologies",
        "Ensured equipment readiness for classes",
        "Performed woodwork, arc welding, wood shop maintenance",
        "Stack: Adobe Photoshop, Adobe Premiere Pro, Pro Logic, Arduino, Raspberry Pi, MakerBot Printers"
      ]
    },
    {
      "company": "The K.I.S. Foundation, Inc.",
      "position": "Part Time Full Stack PHP Developer",
      "website": "http://thekisfoundation.org",
      "startDate": "2010-06-01",
      "endDate": "2017-09-18",
      "summary": "Helped celebrities raise awareness for sickle cell disease by providing an online experience",
      "highlights": [
        "Migrated existing site from Joomla to Wordpress",
        "Developed a customized redesigned Wordpress theme for posting latest updates and charity events",
        "Updated the sites code, design and feel annually",
        "Stack: Wordpress, Joomla, MySQL, PHP, HTML,CSS, Javascript, Adobe Photoshop"
      ]
    },
    {
      "company": "The Next Phase Entertainment, LLC.",
      "position": "Part Time Full Stack PHP Developer",
      "website": "http://weaproblem.com",
      "startDate": "2009-06-01",
      "endDate": "2013-12-30",
      "summary": "Conceptualized, styled and developed unique websites for multiple artists under the Next Phase Entertainment label.",
      "highlights": [
        "Stack: WordPress, PhpMyAdmin, MySQL, PHP, HTML5,CSS3, Jquery, Twitter Bootstrap, Adobe Photoshop"
      ]
    },
    {
      "company": "Medgar Evers College",
      "position": "Flash Animator & GFX Artist Intern",
      "website": "http://www.mec.cuny.edu/",
      "startDate": "2010-09-30",
      "endDate": "2010-12-01",
      "summary": "Working with Macromedia Flash, Created display animations for the TV Screens on campus. Work includes Thanksgiving, Christmas, and environmental ad campaigns",
      "highlights": [
        "Stack: Macromedia Flash, Adobe illustrator, Adobe Photoshop"
      ]
    }
  ],
  "education": [
  {
    "institution": "Hunter College",
    "area": "Emerging Media",
    "studyType": "",
    "startDate": "2014-02-27",
    "endDate": "2014-05-24",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "New York City College of Technology",
    "area": "Emerging Media Technologies",
    "studyType": "",
    "startDate": "2011-11-26",
    "endDate": "2013-05-24",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "Borough of Manhattan Community College",
    "area": "Multimedia Programming & Design",
    "studyType": "Associates",
    "startDate": "2005-01-16",
    "endDate": "2010-12-15",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "School of Cooperative Technical Education",
    "area": "Multimedia Programming & Design",
    "startDate": "2003-12-23",
    "endDate": "2005-01-05",
    "courses": ["Cisco Networking Academy", "A+ CompTIA Computer Repair Training"]
  }
  ],
  "awards": [
    {
      "title": "Hack NYU Hackathon",
      "date": "2014-05-06",
      "awarder": "NYU",
      "summary": "MVP Winner. SudoLove connects participants, sponsors and mentors for global hackathons via an app."
    },
    {
      "title": "AngelHack 2016 Manhattan",
      "date": "2016-06-04",
      "awarder": "AngelHack",
      "summary": "Winning Grand Prize(Hackcelerator) and Best Use Of Amazon Web Services. New York Minute is your pocket companion app to eliminate the frustration of getting around in New York City. It calculates the fastest, cheapest way to get to the desired destination by comparing the Uber car service and public transportation. Target users are New Yorkers who understand the fast pace of New York City life. Sponsors Technologies used Amazon AWS: Elastic Beanstalk, EBS, EC2, Route 53, S3 Amazon Alexa Esri ArcGIS"
    }
  ],
  "references": [
    {
    "name": "Latonia Robinson, Dir. of Operations, The K.I.S. Foundation",
    "reference": "Daniel is an absolute joy to work with and continues to impress us with his technical skill sets. Whenever we have a problem with our website, he always has the answer or recommendations for improvement. Daniel follows direction well, he's always aware of the latest programs or trends, he works well with deadlines, he's able to communicate effectively, he's super reliable, and his experience is absolutely priceless. We're so thankful to have him working with us as part of our team! "
    },
    {
    "name": "Antonio Riccardi, Web Engineer at Basics Plus",
    "reference": "Daniel is one of the best developers we know. His speed and ability to conquer any challenge thrown at him helped us recover our online presence. He led our team here through rigorous challenges with unique solutions each time always getting the job done before the deadlines. Working with him was a blast and we would recommend him when it comes to handling tough projects!"
    }
  ]
}
