{
  "basics": {
    "name": "Daniel Plas Rivera",
    "label": "Python Full Stack Developer",
    "picture": "",
    "email": "plasx1987@gmail.com",
    "phone": "(212) 470-2431",
    "summary": "Over a decade of experience as a Full Stack Web/Application Developer passionate about modern and upcoming technologies. I am addicted to testing out new frameworks and programming languages. I love enabling older applications to work with present day technologies. I enjoy working with front end and back end stacks, even the multiple layers under them.",
    "location": {
      "address": "164 E 112th St",
      "postalCode": "NY 10029",
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "plasx",
        "url": "https://twitter.com/plasx"
      },
      {
      "network": "Linkedin",
      "username": "https://www.linkedin.com/in/plasnyc",
      "url": "https://www.linkedin.com/in/plasnyc"
      },
      {
      "network": "Github",
      "username": "plasx",
      "url": "https://github.com/plasx"
      }
    ]
  },
  "work": [
    {
      "company": "UltraPython LLC",
      "position": "Consultant",
      "startDate": "2017-07-10",
      "summary": "Working in California, New York, and New Jersey with clients such as Bank Of America, Price Waterhouse Coopers, Cox Automotive/Dealertrack, and Capital One.",
      "highlights": [
        "Stay current with trends and incorporate emerging technologies to benefit the customer.",
        "Build REST APIs to match specs provided by other teams to deliver needed functionality.",
        "Executes POCs and feasibility studies to validate next-gen product concepts and technologies leveraging results to guide business and technology decisions.",
        "Work with product owners and other functional teams to translate the road map into releases.",
        "Drive technical designs to consensus and approval.",
        "Stack: Docker, Python2, Python3, Django, Flask, Celery, SQLAlchemy, Sqlite, Oracle, Postgres, MongoDB, Javascript, React, Jenkins, Artifactory, Splunk, New Relic, Git, Microsoft Azure, Terraform, Packer"
      ]
    },
    {
      "company": "Columbia University",
      "position": "Application Systems Developer - Python/PHP",
      "website": "http://columbia.edu",
      "startDate": "2016-04-18",
      "endDate": "2017-07-06",
      "summary": "Worked on transitioning Columbia University to a Python stack while maintaining compatibility with older technologies, including: 1) creating and implementing a server flow working with older components to make sure nothing breaks 2) recreating improved versions of older applications with the Python stack, and 3) creating middleware for older apps to interact with new technologies.",
      "highlights": [
        "Built Full Stack Python Applications for the University.",
        "Wrote Python scripts to parse JSON documents and load the data in database.",
        "Created automated ETL tool from the ground up to transfer from JSON, CSV, TSV, to database daily.",
        "Development locally with Vagrant and Docker for virtualized instances of servers and databases on the fly.",
        "Built REST APIs to serve out data from databases to legacy systems.",
        "Programmatically established levels of authorized access to restrict-allow systems REST API access.",
        "Created automated script to make REST api calls with server, parse output report to excel files daily.",
        "Used GIT, JIRA, and ServiceNOW for version control and to handle project issues, workflow and tickets.",
        "Created and planned out the server flow infrastructure for python web app stack for Columbia University.",
        "Follows Agile SDLC, made sure code is always up to PEP8 standards, and servers (with code) pass unit & load tests.",
        "Create big data apps using existing data from multiple databases at Columbia, prep for Hadoop, demo monthly data using Tableau.",
        "Expose flaws, exploits, problems and solutions during scrums, quickly figure out if requirements provided are impossible or not.",
        "Stack: Python3, python2, GIT, Flask/Blueprint, Service-Now, JIRA, Apache 2.2, Mod_WSGI, Oracle(11g,12c), Axure RP, Vagrant, Docker, Jenkins, Virtualbox, Postman, LTI, Oauth1, Oauth2, REST, Sakai, Canvas, ServiceNow, Unix Bash/Shell Script, CRON, JavaScript, Nodejs, JSON, Tableau, ETL, Data Warehousing"
      ]
    },
    {
      "company": "Basics Plus",
      "position": "Lead Full Stack Developer",
      "website": "http://basicsplus.com",
      "startDate": "2015-01-15",
      "endDate": "2015-06-01",
      "summary": "Delivered an unrivaled online experience that connects to the current POS system for the fast-growing chain of houseware & hardware stores in NYC.",
      "highlights": [
        "Developed an e-commerce solution to ensure the company developed as a national online retailer.",
        "Onboarded and trained the team for Full stack Web Development and the SEO team.",
        "Worked with Google Online Strategist to revamp ad campaigns, increase sales, and raise our site ranking.",
        "Worked with Google Tag Implementation Team to complete the installation of Dynamic Remarketing Code and E-Commerce Tracking in Magento for adwords.",
        "Created and managed, and implemented new features for subsidiaries’ e-commerce companies JuicifyMe, LibrettoEspresso, MyEspressoStore.",
        "Stack: Magento, MySQL, SEO, Google Analytics, Google AdWords, PHP, JavaScript, Jquery, GIT, CSS3, HTML5, Photoshop, Photography, Twitter Bootstrap"
      ]
    }
  ],
  "education": [
  {
    "institution": "Hunter College",
    "area": "Emerging Media",
    "studyType": "",
    "startDate": "2014-02-27",
    "endDate": "2014-05-24",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "New York City College of Technology",
    "area": "Emerging Media Technologies",
    "studyType": "",
    "startDate": "2011-11-26",
    "endDate": "2013-05-24",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "Borough of Manhattan Community College",
    "area": "Multimedia Programming & Design",
    "startDate": "2005-01-16",
    "endDate": "2010-12-15",
    "gpa": "",
    "courses": []
  },
  {
    "institution": "School of Cooperative Technical Education",
    "startDate": "2003-12-23",
    "endDate": "2005-01-05",
    "courses": ["Cisco Networking Academy", "A+ CompTIA Computer Repair Training"]
  }
  ],
  "awards": [
    {
      "title": "Hack NYU Hackathon",
      "date": "2014-05-06",
      "awarder": "NYU",
      "summary": "MVP Winner. SudoLove connects participants, sponsors and mentors for global hackathons via an app."
    },
    {
      "title": "AngelHack 2016 Manhattan",
      "date": "2016-06-04",
      "awarder": "AngelHack",
      "summary": "Winning Grand Prize(Hackcelerator) and Best Use Of Amazon Web Services. New York Minute is your pocket companion app to eliminate the frustration of getting around in New York City. It calculates the fastest, cheapest way to get to the desired destination by comparing the Uber car service and public transportation. Target users are New Yorkers who understand the fast pace of New York City life. Sponsors Technologies used Amazon AWS: Elastic Beanstalk, EBS, EC2, Route 53, S3 Amazon Alexa Esri ArcGIS."
    }
  ],
  "references": [
    {
    "name": "Latonia Robinson, Dir. of Operations, The K.I.S. Foundation",
    "reference": "Daniel is an absolute joy to work with and continues to impress us with his technical skill sets. Whenever we have a problem with our website, he always has the answer or recommendations for improvement. Daniel follows direction well, he's always aware of the latest programs or trends, he works well with deadlines, he's able to communicate effectively, he's super reliable, and his experience is absolutely priceless. We're so thankful to have him working with us as part of our team! "
    },
    {
    "name": "Antonio Riccardi, Web Engineer at Basics Plus",
    "reference": "Daniel is one of the best developers we know. His speed and ability to conquer any challenge thrown at him helped us recover our online presence. He led our team here through rigorous challenges with unique solutions each time always getting the job done before the deadlines. Working with him was a blast and we would recommend him when it comes to handling tough projects!"
    }
  ]
}
